# Brewfile — managed by chezmoi
# Run: brew bundle install

# Core tools
brew "git"
brew "gh"
brew "node"
brew "markdown"
brew "mole"

# Shell enhancements
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"

# Fonts
cask "font-fira-code"
cask "font-inconsolata-nerd-font"
cask "font-sf-mono"

# Apps
cask "ghostty"
cask "cursor"
cask "raycast"
cask "figma"
cask "betterdisplay"
cask "hiddenbar"
cask "helium-browser"
cask "desktoppr"
